org/index.org
#+STARTUP: showall indent hidestars

#+OPTIONS: toc:nil num:nil h:4 html-postamble:nil html-preamble:t tex:t f:t

* Главная страница
Меня зовут Глухов Михаил (Rigidus), моя специализация - компиляторы,
языки программирования, и их среды выполнения (виртуальные машины,
распределенные системы и.т.п.) В свободное время я занимаюсь
любительской робототехникой.

Здесь собраны мои статьи, исcледования, руководства и полезные
материалы. Если вас что-то заинтересовало, или у вас есть интересная
работа - [[file:about/contacts.org][свяжитесь]] со мной

Мое актуальное [[file:about/resume.org][резюме]] содержит не все мои компетенции, а только те,
которые я считаю важными для абстрактного "будущего
работодателя". Возможно я ошибаюсь в том, что для него является важным
на самом деле. Но нужно как-то уложиться в формат пары страниц.

- Обо мне
  - [[file:about/index.org][Личная информация]]
  - [[file:about/resume.org][Резюме]]
  - [[file:about/contacts.org][Контакты]]
- [[file:research.org][Исследования и разработки]]
- [[file:slides.org][Слайды и видео с докладов]]
- [[file:projects.org][Проекты]]
  - [[file:prj/hh.org][Автоматический поиск работы]]
  - [[file:prj/autotest.org][Система автоматизированного тестирования интерфейсов]]
  - [[file:prj/electra.org][Моделирование электронных схем]]
  - [[file:prj/garage.org][Умный гараж с нуля]]
  - [[file:prj/onlisp.org][Перевод OnLisp Пола Грэма]]
  - [[file:prj/course.org][Обучающий курс по программированию]]
    - [[file:../lrn/asm/cmd.org][Анализ ассемблирования и сборки Linux-программы]]
    - [[file:lrn/java/index.org][Интенсив по Java]]
  - [[file:prj/site.org][Как сделан сайт rigidus.ru]]
- Статьи и руководства
  - Lisp в N шагов
    - [[file:../lrn/lisp/lisp-0.org][Lisp-интерпретатор без окружений]]
    - [[file:../lrn/lisp/lisp-1.org][Простой рекурсивный интерпретатор]]
    - [[file:../lrn/lisp/lisp-2.org][Добавляем окружения]]
    - [[file:../lrn/lisp/lisp-3.org][Funarg-проблема и лексические окружения]]
    - [[file:../lrn/lisp/lisp-4.org][Semipredicate-проблема и CPS-style]]
  - [[file:../lrn/forth/jonesforth.org][Минимальный Forth с нуля]]
    - [[file:../lrn/forth/jonesforth-1.org][Внутреннее устройство Forth-машины]]
    - [[file:../lrn/forth/jonesforth-2.org][Высокоуровневая Forth-часть]]
  - [[file:doc/paf.org][Forth как переносимый ассемблер]]
  - [[file:doc/vm-build.org][Построение виртуальной машины]]
  - [[file:../lrn/asm/strip.org][Ищем main без отладочных символов]]
  - [[file:doc/got-plt.org][Что такое @PLT и как libc линкуется в рантайме?]]
  - [[file:doc/literate-programming.org][Литературное программирование]]
  - [[file:doc/oo-dispatch.org][Нетрадиционно ориентированная диспетчеризация]]
  - [[file:doc/remoteswank.org][Удаленное использование swank]]
  - [[file:doc/lisp-features.org][Особенности CL в контексте освоения языка]]
  - [[file:doc/cl-types.org][Типы и декларации типов в Common Lisp]]
  - [[file:doc/cl-vars.org][Лексические и динамические переменные в Common Lisp]]
  - [[file:doc/emacs-set.org][Руководство по кастомизации Emacs]]
  - [[file:doc/org-publish-all.org][Исследование org-publish-all]]
  - [[file:doc/packages-in-lisp.org][Пакеты, системы, модули, библиотеки - WTF?]]
  - [[file:doc/nicodemus-cl-faq.org][Nikodemus Common Lisp FAQ]]
