www/index.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Главная страница</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Меня зовут Глухов Михаил (Rigidus), моя специализация - компиляторы,
языки программирования, и их среды выполнения (виртуальные машины,
распределенные системы и.т.п.) В свободное время я занимаюсь
любительской робототехникой.
</p>

<p>
Здесь собраны мои статьи, исcледования, руководства и полезные
материалы. Если вас что-то заинтересовало, или у вас есть интересная
работа - <a href="about/contacts.html">свяжитесь</a> со мной
</p>

<p>
Мое актуальное <a href="about/resume.html">резюме</a> содержит не все мои компетенции, а только те,
которые я считаю важными для абстрактного "будущего
работодателя". Возможно я ошибаюсь в том, что для него является важным
на самом деле. Но нужно как-то уложиться в формат пары страниц.
</p>

<ul class="org-ul">
<li>Обо мне
<ul class="org-ul">
<li><a href="about/index.html">Личная информация</a>
</li>
<li><a href="about/resume.html">Резюме</a>
</li>
<li><a href="about/contacts.html">Контакты</a>
</li>
</ul>
</li>
<li><a href="research.html">Исследования и разработки</a>
</li>
<li><a href="slides.html">Слайды и видео с докладов</a>
</li>
<li><a href="projects.html">Проекты</a>
<ul class="org-ul">
<li><a href="prj/hh.html">Автоматический поиск работы</a>
</li>
<li><a href="prj/autotest.html">Система автоматизированного тестирования интерфейсов</a>
</li>
<li><a href="prj/electra.html">Моделирование электронных схем</a>
</li>
<li><a href="prj/garage.html">Умный гараж с нуля</a>
</li>
<li><a href="prj/onlisp.html">Перевод OnLisp Пола Грэма</a>
</li>
<li><a href="prj/course.html">Обучающий курс по программированию</a>
<ul class="org-ul">
<li><a href="../lrn/asm/cmd.html">Анализ ассемблирования и сборки Linux-программы</a>
</li>
<li><a href="lrn/java/index.html">Интенсив по Java</a>
</li>
</ul>
</li>
<li><a href="prj/site.html">Как сделан сайт rigidus.ru</a>
</li>
</ul>
</li>
<li>Статьи и руководства
<ul class="org-ul">
<li>Lisp в N шагов
<ul class="org-ul">
<li><a href="../lrn/lisp/lisp-0.html">Lisp-интерпретатор без окружений</a>
</li>
<li><a href="../lrn/lisp/lisp-1.html">Простой рекурсивный интерпретатор</a>
</li>
<li><a href="../lrn/lisp/lisp-2.html">Добавляем окружения</a>
</li>
<li><a href="../lrn/lisp/lisp-3.html">Funarg-проблема и лексические окружения</a>
</li>
<li><a href="../lrn/lisp/lisp-4.html">Semipredicate-проблема и CPS-style</a>
</li>
</ul>
</li>
<li><a href="../lrn/forth/jonesforth.html">Минимальный Forth с нуля</a>
<ul class="org-ul">
<li><a href="../lrn/forth/jonesforth-1.html">Внутреннее устройство Forth-машины</a>
</li>
<li><a href="../lrn/forth/jonesforth-2.html">Высокоуровневая Forth-часть</a>
</li>
</ul>
</li>
<li><a href="doc/paf.html">Forth как переносимый ассемблер</a>
</li>
<li><a href="doc/vm-build.html">Построение виртуальной машины</a>
</li>
<li><a href="../lrn/asm/strip.html">Ищем main без отладочных символов</a>
</li>
<li><a href="doc/got-plt.html">Что такое @PLT и как libc линкуется в рантайме?</a>
</li>
<li><a href="doc/literate-programming.html">Литературное программирование</a>
</li>
<li><a href="doc/oo-dispatch.html">Нетрадиционно ориентированная диспетчеризация</a>
</li>
<li><a href="doc/remoteswank.html">Удаленное использование swank</a>
</li>
<li><a href="doc/lisp-features.html">Особенности CL в контексте освоения языка</a>
</li>
<li><a href="doc/cl-types.html">Типы и декларации типов в Common Lisp</a>
</li>
<li><a href="doc/cl-vars.html">Лексические и динамические переменные в Common Lisp</a>
</li>
<li><a href="doc/emacs-set.html">Руководство по кастомизации Emacs</a>
</li>
<li><a href="doc/org-publish-all.html">Исследование org-publish-all</a>
</li>
<li><a href="doc/packages-in-lisp.html">Пакеты, системы, модули, библиотеки - WTF?</a>
</li>
<li><a href="doc/nicodemus-cl-faq.html">Nikodemus Common Lisp FAQ</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
